# Hierarchical indexing

In [12]:
import numpy as np
import pandas as pd

index = [('California', 2000), ('California', 2010),
        ('New York', 2000), ('New York', 2010),
        ('Texas', 2000), ('Texas', 2010)]

populations = [33871648, 37253956,
                18976457, 19378102,
                20851820, 25145561]

pop = pd.Series(populations, index=index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

Our tuple-based indexing is essentially a rudimentary multi-index, and the Pandas MultiIndex type gives us the type of operations we wish to have. We can create a multi-index from the tuples as follows:

In [13]:
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex(levels=[['California', 'New York', 'Texas'], [2000, 2010]],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]])

In [14]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [4]:
pop[:, 2000]

California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [5]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

### MultiIndex as extra dimension

In [7]:
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [8]:
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [9]:
pop_df = pd.DataFrame({'total': pop,
                        'under18': [9267089, 9284094,
                                    4687374, 4318033,
                                    5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

### Method of multiIndex creation  
The most straightforward way to construct a multiply indexed Series or DataFrameis to simply pass a list of two or more index arrays to the constructor.

In [10]:
import pandas as pd
import numpy as np

df = pd.DataFrame(np.random.rand(8,2),
                  # all array will be in same length
                 index=[['a','a','a','a','b','b','b','b'],[1,2,1,2,1,2,1,2],['c','d','c','d','c','d','c','d']],
                 columns=['data1','data2'])
df

          data1     data2
a 1 c  0.028101  0.275292
  2 d  0.143075  0.173173
  1 c  0.419082  0.889674
  2 d  0.618997  0.673262
b 1 c  0.645272  0.680876
  2 d  0.248674  0.815038
  1 c  0.299437  0.424008
  2 d  0.249757  0.000087

In [15]:
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [19]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [23]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])

columns = pd.MultiIndex.from_product([['Bob', 'Guido', 'Sue'], ['HR', 'Temp']],
                                     names=['subject', 'type'])

# mock some data
data = np.round(np.random.randn(4, 6), 1)
data[:, ::2] *= 10
data += 37

# create the DataFrame
health_data = pd.DataFrame(data, index=index, columns=columns)
health_data

subject      Bob       Guido         Sue
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      29.0  37.1  30.0  35.8  29.0  38.6
     2      34.0  37.8  37.0  37.7  25.0  37.4
2014 1      48.0  36.8  41.0  36.3  27.0  34.8
     2      44.0  35.9  30.0  34.8  46.0  36.6

In [25]:
health_data['Guido']

type          HR  Temp
year visit
2013 1      30.0  35.8
     2      37.0  37.7
2014 1      41.0  36.3
     2      30.0  34.8